---
kind: property
id: P:Autodesk.Revit.DB.Form.ProfileCount
zh: 对话框、窗口、窗体
source: html/274746a9-4c77-3b3d-c814-a2f1384361f2.htm
---
# Autodesk.Revit.DB.Form.ProfileCount Property

**中文**: 对话框、窗口、窗体

The number of profiles in the form.

## Syntax (C#)
```csharp
public int ProfileCount { get; }
```